---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored
source: html/b0275cee-102d-c821-84b2-47d5e2359dfb.htm
---
# VertexStreamPositionColored Properties

Specifies whether the .NET object represents a valid Revit entity.